package com.example.recyclerviews

import android.content.Intent
import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import android.widget.Toast
import androidx.recyclerview.widget.LinearLayoutManager
import androidx.recyclerview.widget.RecyclerView
import java.util.ArrayList

class MainActivity : AppCompatActivity() {

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)

        val imageList = listOf<ItemOfList>(
            ItemOfList(
                R.drawable.img1,
                "Это фиаско, Samsung. Смартфон Samsung Galaxy " +
                        "S20 Ultra занял только седьмое место в рейтинге DxOMark.",
                "Лаборатория DxOMark наконец опубликовала большой обзора камеры одного из самых дорогих флагманов в истории Samsung " +
                        "Galaxy S20 Ultra, который предлагается по цене 1400 долларов.\n" +
                        "\n" +
                        "Мы уже предполагали, что такая задержка обзора была связана с ожиданием стабильной прошивки. После выхода Samsung Galaxy " +
                        "S20 Ultra на рынок производитель выпустил уже несколько обновлений для камеры."+
                        "\n"+
                        "Samsung Galaxy S20 Ultra получил 132 балла за качество фотографий, но всего 102 балла за возможности видеосъемки. " +
                        "Итоговый результат составил 122 балла, что поставило его на седьмое место в рейтинге лучших камерофонов DxOMark. " +
                        "Он набрал столько же, сколько Honor V30 Pro, при этом уступил Huawei P40 Pro (128), Honor 30 Pro+ (125), Oppo Find X2 Pro " +
                        "(124), Xiaomi Mi 10 Pro (124) и Huawei Mate 30 Pro 5G (123).\n" +
                        "\n" +
                        "Эксперты DxOMark оценили качественную цветопередачу и широкий динамический диапазон, а также невысокий уровень шумов при хорошем освещении." +
                        " Отдельной похвалы удостоилась сверхширокоугольная камера, которую назвали одной из лучших в классе.\n" +
                        "\n" +
                        "У Samsung Galaxy S20 Ultra наблюдаются проблемы с работой системы автофокуса на небольших расстояниях и при недостаточном освещении. Во время " +
                        "съемки видео при плохом освещении детализация сильно снижается. По резкости картинки он уступает Xiaomi Mi 10 Pro и другим смартфонам," +
                        " а при увеличении начинают проступать явные артефакты."
            ),
            ItemOfList(
                R.drawable.img2,
                "AMD представила бюджетные 4-ядерные CPU для десктопов от 99 долларов.",
                "AMD расширила семейство процессоров AMD Ryzen 3000, включив в него модели самого начального уровня. Это два настольных процессора Ryzen 3 3100 " +
                        "и Ryzen 3 3300X, а также новый чипсет B550 для дешёвых материнских плат.\n" +
                        "\n" +
                        "Оба процессора основаны на 7-нм микроархитектуре Zen 2 и имеют по четыре ядра с технологией многопоточности SMT (Simultaneous Multithreading), что " +
                        "даёт восемь потоков.\n" +
                        "\n" +
                        "Оба процессора поступят в продажу в коробочном варианте с кулером Wraith. Продажи начинаются 21 мая 2020 года.\n" +
                        "\n" +
                        "Некоторых комментаторов удивили низкие цены новых CPU: всего 100 и 120 долларов. Но если посмотреть на процессоры Intel, то всё выглядит логичным. " +
                        "Для сравнения, у Intel в актуальной линейке за эту цену можно приобрести четырёхъядерный Core i3-9100F из семейства Coffee Lake, выпущенный во II кв. " +
                        "2019 года. Но исходя из технических характеристик, он явно медленнее обеих новинок AMD. Данный процессор изготовлен по техпроцессу 14 нм, TDP 65 Вт, " +
                        "а при тактовой частоте 3,6/4,2 ГГц имеет 6 МБ кэша. Технология Hyper-Threading не поддерживается, то есть у него всего четыре потока.\n" +
                        "\n" +
                        "По внутренним тестам AMD (которым вряд ли можно доверять безоговорочно), AMD Ryzen 3 3100 в играх обеспечивает на 20% большую производительность, " +
                        "чем Core i3-9100. Игры тестировались на разрешении 1080p с максимальными настройками графики: Deus Ex: Mankind Divided; Devil May Cry 5; GTA V; " +
                        "Side Meier’s Civilization VI; Shadow of the Tomb Raider; Counterstrike: Global Offensive; Assassin’s Creed Odysssey; PlayerUnknown’s Battle Grounds; " +
                        "Fortnite и League of Legends.\n" +
                        "\n" +
                        "В тестах на обработку медиаконтента (creator perfomance) AMD Ryzen 3 3100 на 70% превосходит Core i3-9100. Здесь измерялась производительность в " +
                        "следующих программах т бенчмарках: PassMark 10; 3DMark Timespy; PCMark 10; Kraken; 7-Zip; Cinebench; Veracrypt; Blender; Corona; Vray; DaVinci " +
                        "Resolve; Adobe Premiere.\n" +
                        "\n" +
                        "Правда, вскоре выйдут процессоры семейства Comet Lake-S, и тогда конкурентом для младших Ryzen 3000 может стать модель Core i3-10100 с поддержкой" +
                        " Hyper-Threading."
            ),
            ItemOfList(
                R.drawable.img3,
                "Великобритания разрешила Huawei участвовать в создании сети 5G.",
                "Премьер-министр Великобритании Борис Джонсон (Boris Johnson) предоставил китайской компании Huawei возможность ограниченно участвовать в создании " +
                        "британской сети 5G. Это решение принято в условиях давления со стороны Соединенных Штатов, которые настаивали, что оборудование Huawei следует исключить" +
                        " из-за опасений, что Китай может использовать его для шпионажа.\n" +
                        "\n" +
                        "В постановлении правительства сказано, что «поставщики с высоким риском» будут допущены в «нечувствительные» части сетей 5G, но их участие будет " +
                        "ограничено 35%. Они будут исключены из базовой сети, а в критических местах, таких как ядерные объекты и военные базы, — и из радиосети.\n" +
                        "\n"+
                        "Хотя имя компании Huawei не упоминается явно в заявлении британского правительства, не секрет, что китайский производитель коммуникационного " +
                        "оборудования относится к числу «поставщиков с высоким риском».\n" +
                        "\n" +
                        "Ранее администрация президента США предупреждала Лондон, что использование оборудования Huawei может привести к сокращению сотрудничества между " +
                        "США и Британией в области разведки. Реакция Белого дома на решение правительства Великобритании пока неизвестна. Зато известно, что в Huawei " +
                        "удовлетворены этим решением.\n" +
                        "\n" +
                        "По словам Huawei, «это решение, основанное на фактических данных, приведет к созданию более совершенной, более безопасной и экономически эффективной" +
                        " телекоммуникационной инфраструктуры, пригодной для будущего. Оно дает Великобритании доступ к передовым мировым технологиям и обеспечивает " +
                        "конкурентный рынок».\n" +
                        "\n" +
                        "Оборудование Huawei уже используется крупнейшими телекоммуникационными компаниями Великобритании, такими как BT и Vodafone."
            ),
            ItemOfList(
                R.drawable.img4,
                "SAP: выручка от облачных сервисов в 1Q2020 выросла на 29%.",
                "Компания SAP сообщила о финансовых результатах за первый квартал текущего года. Несмотря на пандемию, результаты по сравнению с отчетным " +
                        "периодом прошлого года слегка улучшились.\n" +
                        "\n" +
                        "Выручка SAP за первые три месяца года составила 6,5 млрд евро, что на 7% больше, чем показатель аналогичного периода прошлого года. " +
                        "Прибыль составила 1,21 млрд евро, +1% к первому кварталу 2019-го.\n" +
                        "\n" +
                        "Выручка от облачных сервисов SAP увеличилась за отчетный период на 29% до 2,01 млрд евро. Доходы от лицензирования ПО уменьшилась на 31% " +
                        "до 451 млн евро.\n" +
                        "\n" +
                        "Выручка от сервисов, включая сервисы в области цифровой трансформации, выросла на 5% до 851 млн евро."
            ),
            ItemOfList(
                R.drawable.img5,
                "Штормовой ветер в Москве продлится до вечера среды.",
                "По данным Гидрометцентра, штормовой ветер с порывами до 23 м/с будет продолжаться в Москве до вечера среды, 22 апреля.\n" +
                        "\n" +
                        "Это уже штормовое предупреждение, и очень опасно\", - отметил научный руководитель метеослужбы Роман Вильфанд.\n" +
                        "\n" +
                        "По его словам, усиленный ветровой режим сохранится также в четверг, 23 апреля, но сила ветра немного снизится - ожидаются порывы до 18 м/с."
            )
        )

        into(imageList)
    }

    fun into(list:ArrayList<TitleCreate>){
        val recyclerView = findViewById<RecyclerView>(R.id._imageRecyclerView)
        recyclerView.layoutManager = LinearLayoutManager(this)
        recyclerView.setHasFixedSize(true)

        recyclerView.adapter = ItemAdapter(this,list){
            Toast.makeText(this,"Click", Toast.LENGTH_LONG).show()
            val intent = Intent(this,DetailActivity::class.java)
            intent.putExtra("OBJECT_INTENT",it)
            startActivity(intent)
        }
    }
}
